# Pandas

In [11]:
import pandas as pd
import numpy as np

In [ ]:
# Groupby

In [ ]:
df6 = pd.read_csv(r'D:\Freelance SQL\Python\New folder\samplegroup.csv')
df6

In [ ]:
df6.groupby('company').sum()

In [ ]:
df6.groupby(['company',"person"]).sum()

In [ ]:
df6.groupby('company').mean()

In [ ]:
df6.groupby('company').mean().loc['flipkart']

In [ ]:
df6.groupby('company').sum().loc['flipkart']

In [ ]:
df6.groupby('company').min()

In [ ]:
df6.groupby('company').max()

In [ ]:
df6

In [ ]:
df6["sales"]=df6["sales"].astype(str)

In [ ]:
df6["ID"]=df6.groupby("company")["sales"].transform(lambda x:", ".join(x))

In [ ]:
df6

In [ ]:
df6.drop(["person","sales"],axis=1,inplace=True)

In [ ]:
df6

In [ ]:
df6.drop_duplicates(inplace=True)

In [ ]:
df6

In [ ]:
df6 = pd.read_csv(r'D:\Freelance SQL\Python\New folder\samplegroup.csv')
df6

In [ ]:
df6

In [ ]:
df6.groupby("company")["person"].transform(lambda x:", ".join(x))

In [ ]:
df6

In [ ]:
#  finding unique entries
df6['company'].unique()

In [ ]:
df6['person'].unique()

In [ ]:
len(df6['company'].unique())

In [ ]:
df6['company'].nunique() # finding number of unique values

In [ ]:
# findin the frequency or number of repetition
df6['company'].value_counts()

In [ ]:
# apply method for customised function
df6['sales'].sum()

In [ ]:
import pandas as pd

In [ ]:
# create a DataFrame
df = pd.DataFrame({
    'name': ['Akul','Akul', 'Udit', 'Sai', 'Om'],
    'age': [25,25, 30, 35, 40],
    'gender': ['F','F',  'M', 'M', 'M'],
    'salary': [50000,50000, 60000, 70000, 80000]
})

In [ ]:
df

In [ ]:
df['age']

In [ ]:
df['age'] > 30

In [ ]:
df[df['age'] > 30]

In [ ]:
df

In [ ]:
# extract the rows where age is greater than 30 and salary is greater than 60000
subset = df.loc[(df['age'] > 30) & (df['salary'] > 60000), ['name', 'age', 'salary']]
print(subset)

In [ ]:
subset = df.loc[(df['age'] > 30) & (df['salary'] > 60000), ['name', 'age']]
print(subset)

In [ ]:
df[(df['age'] > 30) & (df['salary'] > 60000)]["name"]

In [ ]:
df[(df['age'] > 30) & (df['salary'] > 60000)]

In [ ]:
df[(df['age'] > 30) | (df['salary'] > 60000)]

In [ ]:
df[(df['age'] > 30) & (df['salary'] > 60000)]["salary"]

In [ ]:
df.loc[(df['age'] > 30) & (df['salary'] > 60000)]

In [ ]:
df.loc[(df['age'] > 30) & (df['salary'] > 60000)][['name', 'age', 'salary']]

In [ ]:
data=df[(df['age'] > 30) & (df['salary'] > 60000)][['name', 'age', 'salary']]
data

In [ ]:
df

In [ ]:
df[(df['age'] ==30) & (df['age']== 35)]

In [ ]:
df[(df['age'] ==30) | (df['age']== 35)]

In [ ]:
df

In [ ]:
df[(df['age'] ==30) & (df['age']== 35)]

In [ ]:
df[(df['age'] ==30) | (df['age']== 35)]

In [ ]:
df.head(2)

In [ ]:
#summary of the dataset
df.describe()

In [ ]:
#information about the dataset
df.info()

In [ ]:
df

In [ ]:
#missing values?
df.isna()

In [ ]:
df.isna().sum()

In [ ]:
df

In [ ]:
# duplicate rows
df.duplicated()

In [ ]:
df[df.duplicated()]

In [ ]:
df.duplicated().sum()

In [ ]:
df[df.duplicated()]

In [ ]:
#Drop duplicates in pandas DataFrame
df.drop_duplicates()

In [ ]:
df.drop_duplicates(inplace=True)

In [ ]:
df

In [ ]:
# Reset index in pandas DataFrame
df.reset_index()

In [ ]:
df.reset_index(drop=False)

In [ ]:
df.reset_index(drop=True)

In [ ]:
df

In [ ]:
df.reset_index(drop=True,inplace=True)

In [ ]:
df

In [ ]:
# Convert Pandas DataFrame to Python dictionary
df2=df.to_dict()
df2

In [ ]:
# Create Pandas DataFrame from Python List
data = [['Akul', 25, 'Mumbai'],
        ['Udit', 30, 'Pune'],
        ['Sai', 35, 'Pune']]

In [ ]:
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
df

In [ ]:
df = pd.DataFrame({
    'name': ['Akul','Akul', 'Udit', 'Sai', 'Om'],
    'age': [36,36, 30, 35, 40],
    'gender': ['F','F',  'M', 'M', 'M'],
    'salary': [90000,50000, 60000, 70000, 80000]
})

In [ ]:
df

In [ ]:
df.sort_values(by='name')

In [ ]:
df.sort_values(by='name', ascending=False)

In [ ]:
df.sort_values(by='age')

In [ ]:
df

In [ ]:
df.sort_values(by=['age', 'salary'], ascending=[False, True])

In [ ]:
df = pd.DataFrame({
    'name': ['Akul','Akul', 'Udit', 'Sai', 'Om'],
    'age': [25,36, np.nan, 35, 40],
    'gender': ['M','M',  'M', 'M', 'M'],
    'salary': [90000,50000, np.nan, 70000, 80000]
})

In [ ]:
df

In [ ]:
# count() :- count the number of non-null values in each column 
df.count()

In [ ]:
# value_counts() :- count the frequency of unique values in a column

In [ ]:
df['name'].value_counts()

## concat, merge, join

concat:

Concatenates two or more dataframes vertically or horizontally, based on the axis parameter.
Does not consider the values of the columns of the dataframes being concatenated.
Can be used to add rows or columns to a dataframe.
The resulting dataframe will have the same columns as the original dataframes being concatenated.

merge:

Merges two or more dataframes based on one or more common columns.
Can be used to combine data based on inner, outer, left, or right joins.
Can handle non-matching values in the columns being merged.
Can handle multiple columns being merged at once.
The resulting dataframe may have new columns and rows depending on how the merge is performed.

join:

Joins two dataframes based on their indices.
Can be used to combine data based on inner, outer, left, or right joins.
Can handle non-matching values in the indices being joined.
Can handle multiple indices being joined at once.
The resulting dataframe may have new columns and rows depending on how the join is performed.

In [ ]:
#  Concatenation
df1 = pd.DataFrame(
    {
        "Roll No": [1,2,3,4,5],
        "Student": ["Akul","Udit","Sai","Raj","Ganesh"],
        "Subject": ["Maths", "Maths", "Maths", "Maths","Maths"],
        "Unit1": [85,86,86,88,89],
    },
    index=[ 1, 2, 3,4,5],
)

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame(
    {
        "Roll No": [1,2,3,4,5],
        "Student": ["Akul","Udit","Sai","Raj","Ganesh"],
        "Subject": ["Sci", "Sci", "Sci", "Sci","Sci"],
        "Unit1": [75,76,76,78,79],
    },
    index=[5, 6, 7,8,9]
)

In [ ]:
df2

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1,df2],axis=0) # default is axis=0

In [ ]:
pd.concat([df1,df2],axis=1) # changing default is axis=0 to 1

In [ ]:
df3 = pd.DataFrame(
    {
        "Roll No": [1,2,3,4,5],
        "Student": ["Akul","Udit","Sai","Praj","Sagar"],
        "Subject": ["Maths", "Maths", "Maths", "Maths","Maths"],
        "Unit1": [85,86,86,88,89],
    },
    index=[ 1, 2, 3,4,5],
)

In [ ]:
df4 = pd.DataFrame(
    {
        "Roll No": [1,2,3,6,7],
        "Student": ["Akul","Udit","Sai","Shubham","Kirti"],
        "Subject": ["Sci", "Sci", "Sci", "Sci","Sci"],
        "Unit1": [75,76,76,78,79],
    },
    index=[4,5, 6, 7,8]
)

In [ ]:
df3

In [ ]:
df4

In [ ]:
pd.concat([df3,df4],axis=0)

In [ ]:
pd.concat([df3,df4],axis=1)

In [ ]:
pd.concat([df3,df4],join="inner")

In [ ]:
pd.concat([df3,df4],join="outer")

In [ ]:
pd.concat([df3,df4],join="inner",axis=1)

In [ ]:
pd.concat([df1,df2],join="outer",axis=1)

In [ ]:
pd.concat([df1,df2],join="right",axis=1)

In [ ]:
pd.concat([df1,df2],join="left",axis=1)

###  Merging   = +on , left, right

In [ ]:
df3

In [ ]:
df4

In [ ]:
pd.merge(df3,df4,on="Roll No", how='inner') # default how=inner   #'left'
                                                        # 'right'
                                                        # 'outer'
                                                        # 'inner'
                                                        # 'cross'

In [ ]:
pd.merge(df3,df4,on="Roll No", how='inner',suffixes=('_df3', '_df4'))

In [ ]:
pd.merge(df3,df4,on=["Roll No","Student"], how='inner',suffixes=('_df1', '_df2'))

In [ ]:
pd.merge(df3,df4,on=["Roll No","Student"], how='outer',suffixes=('_df3', '_df4'))

In [ ]:
pd.merge(df3,df4,on=["Roll No","Student"], how='left',suffixes=('_df1', '_df2'))

In [ ]:
pd.merge(df3,df4,on=["Roll No","Student"], how='right',suffixes=('_df1', '_df2'))

In [12]:
df5 = pd.DataFrame(
    {
        "Exam No": [1,2,3,4,5],
        "Candidate": ["Akul","Udit","Sai","Praj","Sagar"],
        "Subject": ["Maths", "Maths", "Maths", "Maths","Maths"],
        "Unit1": [85,86,86,88,89],
    },
    index=[ 1, 2, 3,4,5],
)

In [13]:
df6 = pd.DataFrame(
    {
        "Roll No": [1,2,3,6,7],
        "Student": ["Akul","Udit","Sai","Shubham","Kirti"],
        "Subject": ["Sci", "Sci", "Sci", "Sci","Sci"],
        "Unit1": [75,76,76,78,79],
    },
    index=[4,5, 6, 7,8]
)

In [ ]:
df5

In [ ]:
df6

In [ ]:
pd.merge(df5,df6,left_on=["Exam No","Candidate"],right_on=["Roll No","Student"], how='inner',suffixes=('_df1', '_df2'))

In [ ]:
pd.merge(df5,df6,left_on=["Exam No","Candidate"],right_on=["Roll No","Student"], how='outer',suffixes=('_df1', '_df2'))

In [ ]:
pd.merge(df5,df6,left_on=["Exam No","Candidate"],right_on=["Roll No","Student"], how='left',suffixes=('_df1', '_df2'))

In [ ]:
data=pd.merge(df5,df6,left_on=["Exam No","Candidate"],right_on=["Roll No","Student"], how='right',suffixes=('_df1', '_df2'))

### REname column

In [ ]:
data

In [ ]:
data.rename(columns={"Exam No":"Roll No","Candidate":"Student"},inplace=True)

In [ ]:
data

#### Joining

In [ ]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

In [ ]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [ ]:
result = left.join(right)

In [ ]:
result

In [ ]:
result1 = right.join(left)

In [ ]:
result1

In [ ]:
left

In [ ]:
right

In [ ]:
left.join(right,how='outer')

In [ ]:
right.join(left) # priority right

In [ ]:
left.join(right,how='inner')

In [ ]:
left.join(right,how='right')

In [ ]:
left

In [ ]:
right

In [ ]:
left.join(right,how='left')

In [ ]:
left.join(right,how='inner')

In [ ]:
df5

## apply()

In [ ]:
#dataframe["colum_name"].apply(function_name)

In [14]:
data=pd.merge(df5,df6,left_on=["Exam No","Candidate"],right_on=["Roll No","Student"], how='inner',suffixes=('_df1', '_df2'))

In [15]:
data

,Exam No,Candidate,Subject_df1,Unit1_df1,Roll No,Student,Subject_df2,Unit1_df2
0,1,Akul,Maths,85,1,Akul,Sci,75
1,2,Udit,Maths,86,2,Udit,Sci,76
2,3,Sai,Maths,86,3,Sai,Sci,76

In [16]:
data["percentage"]=(data["Unit1_df1"]+data["Unit1_df2"])/200*100

In [17]:
data

,Exam No,Candidate,Subject_df1,Unit1_df1,Roll No,Student,Subject_df2,Unit1_df2,percentage
0,1,Akul,Maths,85,1,Akul,Sci,75,80.0
1,2,Udit,Maths,86,2,Udit,Sci,76,81.0
2,3,Sai,Maths,86,3,Sai,Sci,76,81.0

In [18]:
def grade(x):
    if x>80:
        return "A"
    elif x>70:
        return "B"
    else:
        return "C"

In [23]:
data['Grade']=data['percentage'].apply(grade)

In [24]:
data

,Exam No,Candidate,Subject_df1,Unit1_df1,Roll No,Student,Subject_df2,Unit1_df2,percentage,Grade
0,1,Akul,Maths,85,1,Akul,Sci,75,80.0,B
1,2,Udit,Maths,86,2,Udit,Sci,76,81.0,A
2,3,Sai,Maths,86,3,Sai,Sci,76,81.0,A

In [35]:
data2 = {
    'Exam No': [1,2,3,4,5,6,7,8,9,10],
    'Student': ["student1","student2","student3","student4","student5","student6","student7","student8","student9","student10"],
    'Sem1': [34, 45, 67, 38,56,76,66,45,66,73],
    'Sem2': [40, 22, 32, 42,50, 67, 44, 27,44,55],
    'Sem3': [50, 67, 44, 27,67,56,76,55,45,66],
    'Sem4': [32, 55, 34, 34,44, 44,38,56,55,88]
}

In [36]:
data2 = pd.DataFrame(data2)

In [37]:
data2

   Exam No    Student  Sem1  Sem2  Sem3  Sem4
0        1   student1    34    40    50    32
1        2   student2    45    22    67    55
2        3   student3    67    32    44    34
3        4   student4    38    42    27    34
4        5   student5    56    50    67    44
5        6   student6    76    67    56    44
6        7   student7    66    44    76    38
7        8   student8    45    27    55    56
8        9   student9    66    44    45    55
9       10  student10    73    55    66    88

In [ ]:
# data2["Result"]=""

In [38]:
def Result(data2):
    if ((data2["Sem1"]<35) | (data2["Sem2"]<35 )| (data2["Sem3"]<35) | (data2["Sem4"]<35)):
        data2["Result"]="Fail"
    else:
        data2["Result"]="Pass"
    data2["1st Year percentage"]=(data2["Sem1"]+data2["Sem2"])/200*100
    data2["2nd Year percentage"]=(data2["Sem3"]+data2["Sem4"])/200*100
    return data2

In [43]:
data2=data2.apply(Result,axis=1)

In [44]:
data2

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
0,1,student1,34,40,50,32,Fail,37.0,41.0
1,2,student2,45,22,67,55,Fail,33.5,61.0
2,3,student3,67,32,44,34,Fail,49.5,39.0
3,4,student4,38,42,27,34,Fail,40.0,30.5
4,5,student5,56,50,67,44,Pass,53.0,55.5
5,6,student6,76,67,56,44,Pass,71.5,50.0
6,7,student7,66,44,76,38,Pass,55.0,57.0
7,8,student8,45,27,55,56,Fail,36.0,55.5
8,9,student9,66,44,45,55,Pass,55.0,50.0
9,10,student10,73,55,66,88,Pass,64.0,77.0

In [45]:
data2.to_excel(r"D:\Freelance SQL\Python\New folder\Result1.xlsx")

In [46]:
data2.to_excel(r"D:\Freelance SQL\Python\New folder\Result2.xlsx",index=False)

In [ ]:
# data.to_excel(r"D:\Freelance SQL\Python\New folder\Result1.xlsx",index=False)

In [ ]:
# data.to_csv(r"D:\Freelance SQL\Python\New folder\Result2.csv")